package презентація.п6;

import lombok.AllArgsConstructor;
import функції.БінарнийСпоживач;

/**
 * Термінальний оператор, який виконує спорочення потоку на основі вказаного колектора
 */
@AllArgsConstructor
public class ЗбиральнийОператор<T, A, R> implements ТермінальнийОператор<R> {
    private final Потік<T> потік;
    private final Колектор<T, A, R> колектор;

    @Override
    public R закінчити() {
        A контейнер = колектор.контейнер().отримати();
        БінарнийСпоживач<A, T> акумулятор = колектор.акумулятор();
        while (потік.hasNext()) {
            акумулятор.прийняти(контейнер, потік.next());
        }
        return колектор.фінішер().застосувати(контейнер);
    }
}
