package презентація.п3;

import потік.Колектор;
import функції.БінарнийОператор;
import функції.Споживач;
import функції.Умова;
import функції.Функція;

import java.util.Iterator;
import java.util.Optional;

/**
 * Визначає потік елементів з можливістю послідовного виконання базових операцій над ними
 */
public interface Потік<T> extends Iterator<T> {
    /**
     * Повертає новий потік елементів, які відповідають заданій умові
     *
     * @param умова умова, яка визначає чи потрібно включати елемент до результуючого потоку
     * @return новий потік
     */
    Потік<T> фільтр(Умова<T> умова);

    /**
     * Повертає новий потік елементів, який складається з результатів виконання над кожним елементом
     * поточного потоку заданої функції
     *
     * @param конвертер функція, яку треба виконати над кожним елементом потоку
     * @param <R> тип результуючого потоку
     * @return новий потік
     */
    <R> Потік<R> мап(Функція<T, R> конвертер);

    /**
     * Виконує дану дію над кожним елементом потоку
     *
     * @param дія дія, яку треба виконати над кожним елеменотм потоку
     */
    void дляКожного(Споживач<T> дія);
}
