package презентація.п1;

import функції.БінарнийОператор;
import функції.Споживач;
import функції.Умова;
import функції.Функція;

import java.util.Iterator;
import java.util.Optional;

/**
 * Визначає потік елементів з можливістю послідовного виконання базових операцій над ними
 */
public interface Потік<T> extends Iterator<T> {
    /**
     * Виконує дану дію над кожним елементом потоку
     *
     * @param дія дія, яку треба виконати над кожним елеменотм потоку
     */
    void дляКожного(Споживач<T> дія);
}
