package презентація.п5;

import функції.Функція;

import java.util.*;

/**
 * Найбільш вживані реалізації колекторів, які виконують операції скорочення потоку,
 * збираючи елементи в різні типи колекцій
 */
public class Колектори {
    /**
     * Повертає колектор, який збирає всі елементи потоку в новий список
     *
     * @param <T> тип вхідних елементів
     * @return {@link Колектор}, який збирає елементи потоку в список
     */
    public static <T> Колектор<T, ?, List<T>> якСписок() {
        // TODO: треба реалізувати
        return null;
    }

    /**
     * Повертає колектор, який збирає всі елементи потоку в новий сет
     *
     * @param <T> тип вхідних елементів
     * @return {@link Колектор}, який збирає елементи потоку в сет
     */
    public static <T> Колектор<T, ?, Set<T>> якСет() {
        // TODO: треба реалізувати
        return null;
    }

    /**
     * Повертає колектор, який збирає всі елементи потоку в мапу, використовуючи задану функцію
     * для отримання ключа і сам елемент потоку як відповідне йому значення
     *
     * @param екстракторКлюча функція, яка описує спосіб отримання ключа для мапи
     * @param <T> тип вхідних елементів
     * @param <K> тип ключа мапи
     * @return {@link Колектор}, який збирає елементи потоку в мапу, в якій ключом є значення,
     * отримане в результаті виконання заданої функціх над вхідним елементом і значенням є
     * сам елемент потоку
     */
    public static <T, K> Колектор<T, ?, Map<K, T>> якМапа(Функція<T, K> екстракторКлюча) {
        // TODO: треба реалізувати
        return null;
    }

    /**
     * Повертає колектор, який збирає всі елементи потоку в мапу, в якій ключом і значенням є
     * результати виконання даних функцій над вхідним елементом
     *
     * @param екстракторКлюча функція, яка описує спосіб отримання ключа для мапи
     * @param екстракторЗначення функція, яка описує спосіб отримання значення мапи
     * @param <T> тип вхідних елементів
     * @param <K> тип ключа мапи
     * @param <V> тип значення мапи
     * @return {@link Колектор}, який збирає елементи потоку в мапу, в якій ключом і значенням є
     * результати виконання відповідних функцій над вхідним елементом
     */
    public static <T, K, V> Колектор<T, ?, Map<K, V>> якМапа(Функція<T, K> екстракторКлюча,
                                                             Функція<T, V> екстракторЗначення) {
        // TODO: треба реалізувати
        return null;
    }
}
